## Final Project Submission

Please fill out:
* Student name: Shane Mangold
* Student pace: full time
* Scheduled project review date/time: 06/25/2021 5:00pm est
* Instructor name: David Elliott
* Blog post URL:

## Importing the Data

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import pandas as pd
import gzip
from io import StringIO
%matplotlib inline

In [2]:
# This function uses try statements to push through errors and unzip the csv data
def unzip_csv(file_location): 
    file = gzip.open(file_location, 'rb')
    content = file.read()
    file.close()
    try:
        content_str = str(content,'utf-8')
        content_data = StringIO(content_str) 
    except:
        content_str = str(content,'latin-1')
        content_data = StringIO(content_str) 
    try:
        return pd.read_csv(content_data)
    except:
        return pd.read_csv(content_data, sep='\t')

In [3]:
#for copy paste purposes
!ls -la zippedData/

total 45724
drwxr-xr-x 1 smang 197609        0 Jun 19 22:04 .
drwxr-xr-x 1 smang 197609        0 Jun 20 09:55 ..
-rw-r--r-- 1 smang 197609    53544 Jun 19 22:04 bom.movie_gross.csv.gz
-rw-r--r-- 1 smang 197609 18070960 Jun 19 22:04 imdb.name.basics.csv.gz
-rw-r--r-- 1 smang 197609  5599979 Jun 19 22:04 imdb.title.akas.csv.gz
-rw-r--r-- 1 smang 197609  3459897 Jun 19 22:04 imdb.title.basics.csv.gz
-rw-r--r-- 1 smang 197609  1898523 Jun 19 22:04 imdb.title.crew.csv.gz
-rw-r--r-- 1 smang 197609 12287583 Jun 19 22:04 imdb.title.principals.csv.gz
-rw-r--r-- 1 smang 197609   539530 Jun 19 22:04 imdb.title.ratings.csv.gz
-rw-r--r-- 1 smang 197609   498202 Jun 19 22:04 rt.movie_info.tsv.gz
-rw-r--r-- 1 smang 197609  3402194 Jun 19 22:04 rt.reviews.tsv.gz
-rw-r--r-- 1 smang 197609   827840 Jun 19 22:04 tmdb.movies.csv.gz
-rw-r--r-- 1 smang 197609   153218 Jun 19 22:04 tn.movie_budgets.csv.gz

In [4]:
#hard-coding the file-locations and nicknames into a dict for future reference
#Console commands like !ls -la zippedData give a great place to copy pase this

file_locations = [
    'zippedData/bom.movie_gross.csv.gz'
    ,'zippedData/imdb.name.basics.csv.gz'
    ,'zippedData/imdb.title.akas.csv.gz'
    ,'zippedData/imdb.title.basics.csv.gz'
    ,'zippedData/imdb.title.crew.csv.gz'
    ,'zippedData/imdb.title.principals.csv.gz'
    ,'zippedData/imdb.title.ratings.csv.gz'
    ,'zippedData/rt.movie_info.tsv.gz'
    ,'zippedData/rt.reviews.tsv.gz'
    ,'zippedData/tmdb.movies.csv.gz'
    ,'zippedData/tn.movie_budgets.csv.gz'
]

file_nicknames = ['gross','name','akas','basics','crew','principals','ratings','info','reviews','movies','budget']


#this dicitonary comprehension uses a zip function to smush the two lists together and then parse them into a dict
#we also have a reference for each raw df and its location on the drive.

file_dict = {k:v for k,v in zip(file_nicknames,file_locations)}

In [5]:
#Importing all the data, commented out data we didn't use

#gross = unzip_csv(file_dict['gross'])
name = unzip_csv(file_dict['name'])
#akas = unzip_csv(file_dict['akas'])
basics = unzip_csv(file_dict['basics'])
#crew = unzip_csv(file_dict['crew'])
#principals = unzip_csv(file_dict['principals'])
#ratings = unzip_csv(file_dict['ratings'])
#info = unzip_csv(file_dict['info'])
#reviews = unzip_csv(file_dict['reviews'])
#movies = unzip_csv(file_dict['movies'])
budgets = unzip_csv(file_dict['budget'])

## Cleaning the Data

In [6]:
budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [7]:
budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [8]:
#id column is a redundant index so we're dropping it

budgets.drop('id', axis=1, inplace=True)

In [9]:
#setting date column to datatime object for use in charts etc.

budgets['release_date'] = pd.to_datetime(budgets['release_date'])

In [10]:
#stripping any unseen or unknown whitespace from the object locales

budgets.columns.str.strip()
budgets['movie'] = budgets['movie'].str.strip()

In [11]:
#this function launders the money ;D

def clean_money(budgets_series):
    #the map function applys the .replace to each cell in the given series, x[1:] skips the $
    
    return budgets_series.map(lambda x: int(x[1:].replace(',','')))

In [12]:
budgets['production_budget'] = clean_money(budgets['production_budget'])
budgets['domestic_gross'] = clean_money(budgets['domestic_gross'])
budgets['worldwide_gross'] = clean_money(budgets['worldwide_gross']);

In [13]:
#looks good

budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       5782 non-null   datetime64[ns]
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   int64
 3   domestic_gross     5782 non-null   int64
 4   worldwide_gross    5782 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 226.0+ KB

In [14]:
basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [15]:
basics.columns

Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [16]:
basics['movie'] = basics['primary_title']

In [17]:
#we only wanted genres titles, and ttconst for matching to the other file

basics.drop(['primary_title','original_title','start_year'
                ,'runtime_minutes'],axis=1,inplace=True)

In [18]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   tconst  146144 non-null  object
 1   genres  140736 non-null  object
 2   movie   146144 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [19]:
#the strip functions remove unwanted whitespace if its lurking in there

basics.columns = basics.columns.str.strip()

for column in list(basics.columns):
    basics[column] = basics[column].str.strip()

In [20]:
#the dataframe below proivdes a list of indices that contain a null value in the genre column
#the genre column is very important to our analysis so we'll drop null values

to_drop = basics[basics['genres'].isna()==True].index


#simple drop function will finish the job

basics.drop(to_drop,inplace=True)

In [21]:
#this .map will apply a .split to all the genres at each "," creating lists within the df

basics['genres'] = basics['genres'].map(lambda x: x.split(","))

In [22]:
basics['genres'][0]

['Action', 'Crime', 'Drama']

In [23]:
basics['genres'][0][1]

'Crime'

In [24]:
name.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [25]:
#dropping these since they're outside the scope of our analysis

name.drop(['nconst','birth_year','death_year',],axis=1,inplace=True)

In [26]:
name.isnull().sum()

primary_name              0
primary_profession    51340
known_for_titles      30204
dtype: int64

In [27]:
#this phrase finds null values in either column

to_drop = name[(name['primary_profession'].isna()==True)|
               name['known_for_titles'].isna()==True].index

In [28]:
name.drop(to_drop,inplace=True)

In [29]:
#splitting the nested data

name['known_for_titles'] = name['known_for_titles'].map(lambda x: x.split(","))
name['primary_profession'] = name['primary_profession'].map(lambda x: x.split(","));

In [30]:
name['known_for_titles'][0][0]

'tt0837562'

For nested data remember that you can use df.explode() to create a data frame with each known value for a given column with duplicate values in the other columns. This will be usefull when looking at genres and primary professions

In [32]:
name = name.explode('known_for_titles')

In [33]:
name.head()

,primary_name,primary_profession,known_for_titles
0,Mary Ellen Bauder,"[miscellaneous, production_manager, producer]",tt0837562
0,Mary Ellen Bauder,"[miscellaneous, production_manager, producer]",tt2398241
0,Mary Ellen Bauder,"[miscellaneous, production_manager, producer]",tt0844471
0,Mary Ellen Bauder,"[miscellaneous, production_manager, producer]",tt0118553
1,Joseph Bauer,"[composer, music_department, sound_department]",tt0896534

Now each individual 'tt-------' number has an entry in our names list making it easier to join the relevant records on ttconst column

## Combining the DataFrames